{
  "title": "Italian Public Transport Coverage and Efficiency Analysis",
  "map_tab": "Map",
  "method_tab": "Methodology",
  "download_tab": "Download Data",
  "map_caption": "This analysis is based on data derived from Google Maps APIs. ©2025 Google.",
  "short_description_1": "This interactive map lets you explore public transport accessibility in Italy at a highly detailed level.",
  "short_description_2": "Areas, with more vibrant colors indicate locations that are better served, while those with lighter shades represent areas with less service.",
  "short_description_3": "This, analysis allows for a variety of applications, helping to compare any different locations and see which has better public transport service.",
  "short_description_4": "The, scores are calculated based on public transport travel times between a given point and other areas within the same province.",
  "short_description_5": ":warning: This project is still ongoing, and currently, the accessibility data is available only for the provincia of Milano.",
  "method_intro": "In this section, we guide you through the methodology behind the analysis, explaining the key steps and considerations that were taken to evaluate public transport accessibility. The goal of this section is to provide a detailed understanding of how the analysis was carried out, the solution developed, the challenges faced, and the open questions that remain for future work.",
  "cap1_header": "Objective",
  "cap2_header": "Solution",
  "cap3_header": "Next Steps",
  "cap4_header": "Code",
  "cap1_text_1": "The main objective of this analysis is to precisely identify areas well-served by public transport across Italy. The goal is to create a quantitative score that is as objective as possible, allowing for a fair and accurate comparison between any two zones in the country.",
  "cap1_text_2": "By focusing on a detailed and data-driven approach, this methodology aims to provide a clear and standardized measure of public transport accessibility, helping to highlight areas of strength and areas in need of improvement.",
  "cap2_1_header": "The Idea",
  "cap2_1_text": "The idea behind this analysis is to calculate the public transport travel times from the point where the score is being calculated to 'every' other part of the province. By averaging these values, weighted by the distance traveled, we obtain an accessibility score for the starting point. This approach ensures that the score reflects the level of connectivity of each point within its surrounding area, providing a more nuanced and precise measurement of public transport accessibility.",
  "cap2_2_header": "The Grid",
  "cap2_2_text": "How are the points for calculating the distances chosen? The answer is to create a grid over the province. The resolution of this grid must be high enough to ensure an adequate level of detail for the analysis, but not so fine as to make the calculations too computationally expensive. The resolution currently used is 500m x 500m, striking a balance between detail and computational efficiency.",
  "cap2_3_header": "Two-Grid Method",
  "cap2_3_text_1": "To calculate the accessibility score with a high resolution, a two-stage grid system is used. First, a fine grid is created over the province, with high-resolution points where the accessibility score for each location will be calculated. This fine grid provides the detailed output of the analysis, capturing the granularity of the public transport service.",
  "cap2_3_text_2": "Next, a second, less dense grid is overlaid on the province. The points in this coarser grid serve as the locations to which each point of the fine grid will be compared to calculate travel times using public transport. This second grid is less detailed because its primary function is to identify the key destinations for travel time calculation, not to directly impact the resolution of the final accessibility score.",
  "cap2_3_text_3": "The use of a coarse grid reduces the computational cost of the analysis without compromising the level of detail in the final output, as the fine grid's resolution determines the granularity of the accessibility scores.",
  "cap2_4_header": "Route Reduction and Clustering",
  "cap2_4_text_1": "To optimize the calculation of accessibility scores and reduce computational costs, several methods are used to streamline the number of routes involved in the analysis. First, points are filtered to include only those within 500 meters of a public transport stop. This ensures that only areas with direct access to public transport are considered, excluding points that are too far from any transit services.",
  "cap2_4_text_2": "Next, clustering is applied to the less dense grid described earlier. The points are grouped into clusters, with a fixed number of 50 points per cluster in each province. Clustering reduces the number of routes considered for calculation while still maintaining an adequate level of detail for the analysis.",
  "cap2_5_header": "Travel Time Calculation Using Public Transport",
  "cap2_5_text": "The next step in the analysis was to calculate travel times using public transport. For this, the Google Maps API was chosen as the data source, providing access to the most up-to-date and accurate data available. Using the API, the travel time for each pair of points in the grid was calculated, which, together with the air distance, will be used to weigh the travel time for the score calculation.",
  "cap2_6_header": "The Score",
  "cap2_6_text_1": "This step is crucial as it involves how to aggregate the scores to properly weigh the different travel times calculated for each starting point. There are several ways to perform this aggregation, and the challenge lies in the absence of a clear reference to determine the most appropriate method for calculating a public transport accessibility score.",
  "cap2_6_text_2": "Currently, the calculation involves determining the average speed of each trip, which is computed as the ratio between the air distance (to avoid favoring fast routes with significant deviations) and the travel time. This score is then averaged and divided by the mean distance to the destination points within the same province.",
  "cap2_6_text_3": "While further analyses are underway to refine this process, this method provides a useful starting point for measuring accessibility to public transport in a meaningful way.",
  "cap3_text_1": "While the current analysis provides valuable insights into public transport accessibility, several key tasks remain to further improve and refine the results.",
  "cap3_text_2": "1. Complete the analysis for other provinces: The analysis is currently available for the province of Milan, but expanding the coverage to additional provinces is essential to create a comprehensive map of public transport accessibility across Italy.",
  "cap3_text_3": "2. Optimize route filtering: An important next step is finding an additional filter to reduce the number of routes used to calculate travel times. This will help decrease the computational cost associated with using the Google Maps API, ensuring the analysis remains scalable and efficient.",
  "cap3_text_4": "3. Develop a validation method: Another crucial task is to establish a method for validating the results. This will help ensure the accuracy of the accessibility scores and enable the identification of the most effective method for calculating the scores.",
  "cap3_text_5": "These next steps are vital for enhancing the quality of the analysis, improving scalability, and ensuring that the chosen methods are both effective and reliable.",
  "cap4_text_1": "This analysis was developed using Python, and the full code is available in the GitHub repository ([link](https://github.com/stefanogelli92/public_transport_italy)).",
  "cap4_text_2": "Please note that in order to run the code, a valid Google Maps API key is required to access the public transport data.",
  "download_text_1": "You can download the results of the analysis in CSV format by clicking the link below.",
  "download_text_2": " - [public_transport_score_grid.csv](https://drive.google.com/file/d/1skm8LKcafcWy2aT0C5YQwntc7uAOVcQ5/view?usp=drive_link) (File size: 293 KB)",
  "download_header_1": "Dataset Structure",
  "download_text_3": "| Column   |      Description      |\n|----------|-------------|\n| Latitude |  The latitude of the point in the grid (in decimal degrees). |\n| Longitude |    The longitude of the point in the grid (in decimal degrees).   |\n| Score | The accessibility score for that point, calculated based on the public transport analysis. |",
  "download_text_4": "The coordinates in the dataset are in the Google Maps reference system (EPSG:4326), which uses latitude and longitude in decimal degrees."
}