{
  "title": "Analisi della copertura e dell'efficienza del trasporto pubblico italiano",
  "map_tab": "Mappa",
  "method_tab": "Metodologia",
  "download_tab": "Download Dati",
  "map_caption": "Questa analisi è basata su elaborazione di dati derivati dalle APIs di Google Maps. ©2025 Google.",
  "short_description_1": "Questa mappa interattiva ti permette di esplorare il livello di servizio dei mezzi pubblici in Italia (treni, metropolitane, autobus, tram e altri trasporti) ad un livello di dettaglio molto elevato.",
  "short_description_2": "Le zone più colorate indicano aree che sono meglio servite dai mezzi pubblici, mentre le aree con colori più chiari corrispondono a quelle con una minore disponibilità di trasporti.",
  "short_description_3": "Questa analisi permette di confrontare facilmente la qualità del servizio tra due punti qualsiasi. Possiamo infatti confrontare gli score di accessibilità per due località diverse e vedere in quale delle due zone il servizio di trasporto pubblico è più efficiente.",
  "short_description_4": "I punteggi sono calcolati in base ai tempi di percorrenza tra un punto e le altre aree della stessa provincia, considerando vari mezzi pubblici.",
  "short_description_5": ":warning: Questo progetto è ancora in corso e attualmente i dati sull'accessibilità sono disponibili solo per la provincia di Milano.",
  "method_intro": "In questa sezione, viene descritta la metodologia alla base dell'analisi, spiegando i passaggi principali e le considerazioni adottate per valutare l'accessibilità ai mezzi pubblici. L'obiettivo di questa sezione è fornire una comprensione dettagliata su come è stata realizzata l'analisi, la soluzione sviluppata, le sfide affrontate e le questioni aperte che rimangono per il futuro.",
  "cap1_header": "Obiettivo",
  "cap2_header": "Soluzione",
  "cap3_header": "Prossimi Passi",
  "cap4_header": "Codice",
  "cap1_text_1": "L'obiettivo principale di questa analisi è identificare in modo preciso le aree ben servite dai mezzi pubblici in tutta Italia. L'intento è creare un punteggio quantitativo il più oggettivo possibile, che permetta un confronto equo e accurato tra qualsiasi due zone del paese.",
  "cap1_text_2": "Concentrandosi su un approccio dettagliato e basato sui dati, questa metodologia mira a fornire una misura chiara e standardizzata dell'accessibilità ai mezzi pubblici, aiutando a evidenziare le aree di forza e quelle che necessitano di miglioramenti.",
  "cap2_1_header": "L'idea",
  "cap2_1_text": "L'idea alla base di questa analisi è calcolare i tempi di percorrenza dei mezzi pubblici dal punto in cui viene calcolato il punteggio verso ogni altra parte della provincia. Mediando questi valori, ponderati dalla distanza percorsa, otteniamo un punteggio di accessibilità per il punto di partenza. Questo approccio garantisce che il punteggio rifletta il livello di connettività di ogni punto all'interno della sua area circostante, fornendo una misura più precisa e sfumata dell'accessibilità ai mezzi pubblici.",
  "cap2_2_header": "La Griglia",
  "cap2_2_text": "Come vengono scelti i punti per calcolare le distanze? La risposta è creare una griglia sulla provincia. La risoluzione di questa griglia deve essere abbastanza alta da garantire un livello adeguato di dettaglio per l'analisi, ma non così fine da rendere i calcoli troppo costosi dal punto di vista computazionale. La risoluzione attualmente utilizzata è di 500 m x 500 m, un compromesso tra dettaglio e efficienza computazionale.",
  "cap2_3_header": "Metodo a due griglie",
  "cap2_3_text_1": "Per calcolare il punteggio di accessibilità con una risoluzione elevata, viene utilizzato un sistema a due stadi. In primo luogo, viene creata una griglia fine sulla provincia, con punti ad alta risoluzione dove verrà calcolato il punteggio di accessibilità per ogni località. Questa griglia fine fornisce l'output dettagliato dell'analisi, catturando la granularità del servizio di trasporto pubblico.",
  "cap2_3_text_2": "Successivamente, viene sovrapposta una seconda griglia meno densa sulla provincia. I punti di questa griglia più grossolana servono come località di riferimento per confrontare ogni punto della griglia fine e calcolare i tempi di percorrenza tramite mezzi pubblici. Questa seconda griglia è meno dettagliata perché la sua funzione principale è identificare le destinazioni chiave per il calcolo dei tempi di percorrenza, senza influire direttamente sulla risoluzione del punteggio finale di accessibilità.",
  "cap2_3_text_3": "L'uso di una griglia grossolana riduce il costo computazionale dell'analisi senza compromettere il livello di dettaglio nell'output finale, poiché è la risoluzione della griglia fine a determinare la granularità dei punteggi di accessibilità.",
  "cap2_4_header": "Riduzione dei percorsi e clustering",
  "cap2_4_text_1": "Per ottimizzare il calcolo dei punteggi di accessibilità e ridurre i costi computazionali, vengono utilizzati diversi metodi per semplificare il numero di percorsi coinvolti nell'analisi. In primo luogo, i punti vengono filtrati per includere solo quelli situati a meno di 500 metri da una fermata di trasporto pubblico. Questo assicura che vengano considerate solo le aree con accesso diretto ai mezzi pubblici, escludendo i punti troppo lontani da qualsiasi servizio di trasporto.",
  "cap2_4_text_2": "Successivamente, viene applicato il clustering sulla griglia meno densa descritta in precedenza. I punti vengono raggruppati in cluster, con un numero fisso di 50 punti per cluster in ogni provincia. Il clustering riduce il numero di percorsi considerati per il calcolo, mantenendo comunque un livello adeguato di dettaglio per l'analisi.",
  "cap2_5_header": "Calcolo dei tempi di percorrenza tramite mezzi pubblici",
  "cap2_5_text": "Il passo successivo nell'analisi è il calcolo dei tempi di percorrenza utilizzando i mezzi pubblici. Per questo, è stata scelta l'API di Google Maps come fonte di dati, poiché fornisce accesso ai dati più aggiornati e accurati disponibili. Utilizzando l'API, è stato calcolato il tempo di percorrenza per ogni coppia di punti nella griglia, che, insieme alla distanza aerea, verrà utilizzato per ponderare il tempo di percorrenza nel calcolo del punteggio.",
  "cap2_6_header": "Il Punteggio",
  "cap2_6_text_1": "Questo passaggio è cruciale in quanto riguarda come aggregare i punteggi per ponderare correttamente i diversi tempi di percorrenza calcolati per ogni punto di partenza. Esistono diversi modi per effettuare questa aggregazione, e la sfida consiste nell'assenza di un riferimento chiaro per determinare il metodo più appropriato per calcolare un punteggio di accessibilità ai mezzi pubblici.",
  "cap2_6_text_2": "Attualmente, il calcolo prevede la determinazione della velocità media di ogni viaggio, che viene calcolata come il rapporto tra la distanza aerea (per evitare di favorire percorsi veloci con deviazioni significative) e il tempo di percorrenza. Questo punteggio viene poi mediato e diviso per la distanza media dai punti di destinazione all'interno della stessa provincia.",
  "cap2_6_text_3": "Mentre ulteriori analisi sono in corso per affinare questo processo, questo metodo fornisce un buon punto di partenza per misurare l'accessibilità ai mezzi pubblici in modo significativo.",
  "cap3_text_1": "Sebbene l'analisi attuale fornisca preziose informazioni sull'accessibilità ai mezzi pubblici, rimangono diverse attività chiave per migliorare e affinare i risultati.",
  "cap3_text_2": "1. Completare l'analisi per altre province: Attualmente l'analisi è disponibile solo per la provincia di Milano, ma espandere la copertura ad altre province è fondamentale per creare una mappa completa dell'accessibilità ai mezzi pubblici in tutta Italia.",
  "cap3_text_3": "2. Ottimizzare il filtro dei percorsi: Un importante passo successivo è trovare un ulteriore filtro per ridurre il numero di percorsi utilizzati nel calcolo dei tempi di percorrenza. Questo aiuterà a ridurre i costi computazionali associati all'uso dell'API di Google Maps, garantendo che l'analisi rimanga scalabile ed efficiente.",
  "cap3_text_4": "3. Sviluppare un metodo di validazione: Un'altra attività cruciale è stabilire un metodo per validare i risultati. Questo aiuterà a garantire l'accuratezza dei punteggi di accessibilità e permetterà di identificare il metodo più efficace per calcolare i punteggi.",
  "cap3_text_5": "Questi passi sono fondamentali per migliorare la qualità dell'analisi, aumentarne la scalabilità e garantire che i metodi scelti siano sia efficaci che affidabili.",
  "cap4_text_1": "Questa analisi è stata sviluppata utilizzando Python, e il codice completo è disponibile nel repository GitHub ([link](https://github.com/stefanogelli92/public_transport_italy)).",
  "cap4_text_2": "Si noti che per eseguire il codice è necessario avere una chiave API valida di Google Maps per accedere ai dati sui mezzi pubblici.",
  "download_text_1": "Puoi scaricare i dati in formato csv cliccando sul link di seguito.",
  "download_text_2": " - [public_transport_score_grid.csv](https://drive.google.com/file/d/1skm8LKcafcWy2aT0C5YQwntc7uAOVcQ5/view?usp=drive_link) (File size: 293 KB)",
  "download_header_1": "Struttura dei dati",
  "download_text_3": "| Colonna   |      Descrizione      |\n|----------|-------------|\n| Latitude |  La latitudine del punto della griglia. |\n| Longitude |    La longitudine del punto della griglia.   |\n| Score | Il punteggio di accessibilità ai mezzi pubblici del punto risultato dell'analisi. |",
  "download_text_4": "Le coordinate del dataset sono nel sistema di riferimento usato da Google Maps (EPSG:4326), che usano la latitudine e longitudine in gradi decimali."
}
